app/views/tasks/create.js.erb

INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2019-08-29 07:45:52.749957"], ["updated_at", "2019-08-29 07:45:52.749957"], ["title", "buertesterf"], ["deadline", "2019-09-06 00:00:00"], ["category_id", 7]]
---

document.getElementById("<%=@category.title.split.join%>").insertAdjacentHTML("beforeend", "<%= j render 'task', task: @task %>");