app/views/home/index.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."category_id" = $1  [["category_id", 19]]
---

      <% category.tasks.each do |task| %>