app/controllers/emails_controller.rb

  def index
    @email = Email.all
---
SELECT "emails".* FROM "emails"

  def create
    @email = Email.create(object: Faker::Internet.email, body: Faker::Music.album, read: false)
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at", "read") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["object", "chancehauck@moriette.org"], ["body", "The Sign"], ["created_at", "2019-08-29 21:25:03.142724"], ["updated_at", "2019-08-29 21:25:03.142724"], ["read", false]]

  def show
    @email = Email.find(params[:id])
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 75], ["LIMIT", 1]]

  def destroy
    @email = Email.find(params[:id])
    @email.destroy
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 82], ["LIMIT", 1]]
DELETE FROM "emails" WHERE "emails"."id" = $1  [["id", 82]]

  def update

    @email = Email.find(params[:id])
    if @email.read ==  false
        @email.read= true
        @email.save
    else
      @email.read = false
      @email.save
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 88], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2019-08-30 00:45:05.240876"], ["id", 88]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", false], ["updated_at", "2019-08-30 00:45:41.247635"], ["id", 85]]