app/controllers/home_controller.rb

SELECT "tasks".* FROM "tasks"
SELECT "categories".* FROM "categories"
---
  def index
    @tasks = Task.all
    @categories = Category.all