app/controllers/tasks_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2019-08-29 07:43:29.975777"], ["updated_at", "2019-08-29 07:43:29.975777"], ["title", "ddr"], ["deadline", "2019-09-07 00:00:00"], ["category_id", 7]]
---
  def create
    @task = Task.new(task_params)
    @category = Category.find(category_params)
    @task.category = @category

    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 201], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", true], ["updated_at", "2019-08-29 14:14:30.943071"], ["id", 201]]
UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", false], ["updated_at", "2019-08-29 14:59:05.303414"], ["id", 204]]
---
  def update
    @task = Task.find(params[:id])

    if params[:tag_name] == "1"
      @task.status = true
      @task.save
    else
      @task.status = false
      @task.save