app/views/emails/create.js.erb


document.getElementById("mail").insertAdjacentHTML("beforeend", "<%= j render 'email', email: @email %>");
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "solid state"], ["body", " Present and Future"], ["created_at", "2019-08-29 18:44:18.732684"], ["updated_at", "2019-08-29 18:44:18.732684"]]